app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title ILIKE '%challange.liquid%')
---
  def search
    if params[:search].present?
      @movies = Movie.search(params[:search])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1 ORDER BY created_at desc  [["movie_id", 6]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1 ORDER BY created_at desc  [["movie_id", 4]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1 ORDER BY created_at desc  [["movie_id", 2]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 4]]
---
  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at desc")

    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2)

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "director" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["director", "Jane Louis"], ["updated_at", "2020-05-09 21:50:48.075280"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)