app/controllers/movies_controller.rb

  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "movies"."id" = $5  [["image_file_name", "download_(4).jpeg"], ["image_file_size", 7049], ["image_updated_at", "2020-05-10 20:14:38.713706"], ["updated_at", "2020-05-10 20:14:38.800204"], ["id", 3]]