app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id
    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "movie_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 5], ["comment", "Superb Movie"], ["created_at", "2020-05-11 20:51:45.587661"], ["updated_at", "2020-05-11 20:51:45.587661"], ["user_id", 1], ["movie_id", 3]]